Autodesk.Navisworks.Api.SelectionSet
Autodesk.Navisworks.Api.SavedItem containing a saved Autodesk.Navisworks.Api.ModelItemCollection or Autodesk.Navisworks.Api.SelectionSet.Search

Autodesk.Navisworks.Api.SelectionSet.#ctor
Create a SelectionSet with empty ExplicitModelItems

Autodesk.Navisworks.Api.SelectionSet.#ctor(Autodesk.Navisworks.Api.ModelItemCollection)
Create a SelectionSet with ExplicitModelItems
Throws System.ArgumentNullException:
Argument 'items' is null
Throws System.ArgumentException:
Argument 'items' has been Disposed

Autodesk.Navisworks.Api.SelectionSet.#ctor(Autodesk.Navisworks.Api.Search)
Create a SelectionSet with a Search
Throws System.ArgumentNullException:
Argument 'search' is null
Throws System.ArgumentException:
Argument 'search' has been Disposed
Throws System.ArgumentException:
Argument 'search' has no SearchConditions

Autodesk.Navisworks.Api.SelectionSet.#ctor(Autodesk.Navisworks.Api.SelectionSet)
Create a copy of another SelectionSet
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.SelectionSet.CopyFrom(Autodesk.Navisworks.Api.ModelItemCollection)
Initialize SelectionSet with copy of ExplicitModelItems
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'items' is null
Throws System.ArgumentException:
Argument 'items' has been Disposed

Autodesk.Navisworks.Api.SelectionSet.CopyFrom(Autodesk.Navisworks.Api.Search)
Initialize SelectionSet with copy of a Search
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'search' is null
Throws System.ArgumentException:
Argument 'search' has been Disposed
Throws System.ArgumentException:
Argument 'search' has no SearchConditions

Autodesk.Navisworks.Api.SelectionSet.CopyFrom(Autodesk.Navisworks.Api.SelectionSet)
Initialize SelectionSet with copy of another SelectionSet
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.SelectionSet.CopyFrom(System.Collections.Generic.IEnumerable{Autodesk.Navisworks.Api.ModelItem})
Initialise as explicit ModelItems with items in from
from: The collection to copy contents from
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.SelectionSet.ExplicitModelItems
The explicit ModelItems stored in the selection set
Throws System.InvalidOperationException:
Invalid operation when '!HasExplicitModelItems'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SelectionSet.GetSelectedItems
Returns a ModelItemCollection that represents the items specified by this SelectionSet in the document
which it is associated with.
Throws System.NotSupportedException:
No document is associated with this SelectionSet

Autodesk.Navisworks.Api.SelectionSet.GetSelectedItems(Autodesk.Navisworks.Api.Document)
Returns a ModelItemCollection that represents the items specified by this SelectionSet in document.
document:
Document to search (if required)
Throws System.ArgumentNullException:
Argument 'document' is null
Throws System.InvalidOperationException:
SelectionSet contains explicit items from a different document

Autodesk.Navisworks.Api.SelectionSet.HasExplicitModelItems
Does the SelectionSet contain an explicit set of ModelItems ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SelectionSet.HasSearch
Does the SelectionSet contain a Search ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SelectionSet.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SelectionSet.Search
The Search stored in the selection set
Throws System.InvalidOperationException:
Invalid operation when '!HasSearch'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.SelectionSet.ValueEquals(Autodesk.Navisworks.Api.SelectionSet)
Performs comparison 'By Value'

Autodesk.Navisworks.Api.SelectionSet.ValueEquals(Autodesk.Navisworks.Api.SelectionSet,Autodesk.Navisworks.Api.SelectionSet)
Compares the two references 'By Value'